## Pandas Tutorial

### 1. how to import pandas library?

In [95]:
import pandas

----------------------------------------------------

### 2. how to check pandas version?

In [96]:
pandas.__version__

'2.2.2'

----------------------------------------------------

### 3. how to use pandas?

In [97]:
import pandas as pd

----------------------------------------------------

### 4. how to import data from a csv file?

#### *read_csv()*

In [98]:
df = pd.read_csv('../data/olympics.csv',skiprows=4)

----------------------------------------------------

### 5. how to access the data frame?

In [99]:
df

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver
...,...,...,...,...,...,...,...,...,...,...
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

----------------------------------------------------

### 6. how to list few data instances?

#### *.head()*; *tail()*

In [100]:
df.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [101]:
df.tail(3)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

----------------------------------------------------

### 7. how to get the info about data?

#### *.info()*; *.shape()*

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          29216 non-null  object
 1   Edition       29216 non-null  int64
 2   Sport         29216 non-null  object
 3   Discipline    29216 non-null  object
 4   Athlete       29216 non-null  object
 5   NOC           29216 non-null  object
 6   Gender        29216 non-null  object
 7   Event         29216 non-null  object
 8   Event_gender  29216 non-null  object
 9   Medal         29216 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

In [103]:
df.shape

(29216, 10)

In [104]:
# df.shape[0 = rows]
df.shape[0]

29216

In [105]:
# df.shape[1 = cols]
df.shape[1]

10

----------------------------------------------------

### 8. how to check the data type?

#### *type()*

In [106]:
type(df)

pandas.core.frame.DataFrame

In [107]:
type(df.City)

pandas.core.series.Series

In [108]:
type(df[['City','Edition','Athlete']])

pandas.core.frame.DataFrame

----------------------------------------------------

### 9. how to access columns/series using []?

In [109]:
df['Athlete']

0               HAJOS, Alfred
1            HERSCHMANN, Otto
2           DRIVAS, Dimitrios
3          MALOKINIS, Ioannis
4          CHASAPIS, Spiridon
                 ...
29211          ENGLICH, Mirko
29212    MIZGAITIS, Mindaugas
29213         PATRIKEEV, Yuri
29214           LOPEZ, Mijain
29215          BAROEV, Khasan
Name: Athlete, Length: 29216, dtype: object

----------------------------------------------------

### 10. how to access columns/series using dot notation?

In [110]:
df.Athlete

0               HAJOS, Alfred
1            HERSCHMANN, Otto
2           DRIVAS, Dimitrios
3          MALOKINIS, Ioannis
4          CHASAPIS, Spiridon
                 ...
29211          ENGLICH, Mirko
29212    MIZGAITIS, Mindaugas
29213         PATRIKEEV, Yuri
29214           LOPEZ, Mijain
29215          BAROEV, Khasan
Name: Athlete, Length: 29216, dtype: object

----------------------------------------------------

### 11. how to access multiple columns?

In [111]:
df[['City','Edition','Athlete']]

          City  Edition               Athlete
0       Athens     1896         HAJOS, Alfred
1       Athens     1896      HERSCHMANN, Otto
2       Athens     1896     DRIVAS, Dimitrios
3       Athens     1896    MALOKINIS, Ioannis
4       Athens     1896    CHASAPIS, Spiridon
...        ...      ...                   ...
29211  Beijing     2008        ENGLICH, Mirko
29212  Beijing     2008  MIZGAITIS, Mindaugas
29213  Beijing     2008       PATRIKEEV, Yuri
29214  Beijing     2008         LOPEZ, Mijain
29215  Beijing     2008        BAROEV, Khasan

[29216 rows x 3 columns]

----------------------------------------------------

### 12. how to obtain the frequency of unique values in a series?

#### *.value_counts()*

In [112]:
df.Edition.value_counts()

Edition
2008    2042
2000    2015
2004    1998
1996    1859
1992    1705
1988    1546
1984    1459
1980    1387
1976    1305
1920    1298
1972    1185
1968    1031
1964    1010
1952     889
1912     885
1956     885
1924     884
1960     882
1936     875
1948     814
1908     804
1928     710
1932     615
1900     512
1904     470
1896     151
Name: count, dtype: int64

In [113]:
# This command will return a series with the counts of each unique value in the "Gender" column, including NaN values, sorted in ascending order.
df.Gender.value_counts(ascending=True,dropna=False)

Gender
Women     7495
Men      21721
Name: count, dtype: int64

----------------------------------------------------

### 13. how to sort a data frame or a series along either axis?

#### *.sort_values()*; *axis=0 (rows):*, *axis=1 (columns):*

In [114]:
athlete = df.Athlete.sort_values()
athlete

651                 AABYE, Edgar
2849       AALTONEN, Arvo Ossian
2852       AALTONEN, Arvo Ossian
7716    AALTONEN, Paavo Johannes
7730    AALTONEN, Paavo Johannes
                  ...
603                   ÖSTMO, Ole
608                   ÖSTMO, Ole
621                   ÖSTMO, Ole
596                   ÖSTMO, Ole
8051           ÖSTRAND, Per-Olof
Name: Athlete, Length: 29216, dtype: object

In [115]:
df.sort_values(by=['Edition','Athlete'])

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
7,Athens,1896,Aquatics,Swimming,"ANDREOU, Joannis",GRE,Men,1200m freestyle,M,Silver
82,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,rope climbing,M,Gold
110,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,"team, parallel bars",M,Silver
111,Athens,1896,Gymnastics,Artistic G.,"ATHANASOPOULOS, Spyros",GRE,Men,"team, parallel bars",M,Silver
48,Athens,1896,Cycling,Cycling Road,"BATTEL, Edward",GBR,Men,individual road race,M,Bronze
...,...,...,...,...,...,...,...,...,...,...
28095,Beijing,2008,Equestrian,Dressage,"ZU-SAYN WITTGENSTEIN, Nathalie",DEN,Women,team,X,Bronze
28819,Beijing,2008,Sailing,Sailing,"ZUBARI, Shahar",ISR,Men,RS:X - Windsurfer,M,Bronze
28977,Beijing,2008,Taekwondo,Taekwondo,"ZUBCIC, Martina",CRO,Women,49 - 57 kg,W,Bronze
28387,Beijing,2008,Gymnastics,Rhythmic G.,"ZUEVA, Natalia",RUS,Women,group competition,W,Gold
29007,Beijing,2008,Tennis,Tennis,"ZVONAREVA, Vera",RUS,Women,singles,W,Bronze

----------------------------------------------------

### 14. how to use indexing?

In [116]:
# In pandas, the index attribute represents the index (row labels) of a DataFrame or Series. 
# You can access it directly using the index attribute.

#### *set_index() to set a DataFrame's index with a specific column.*

In [117]:
# The inplace=True parameter is used to modify the DataFrame in place, without the need to create a new DataFrame. 
# If inplace=False or not specified (the default), a new DataFrame with the reset index is returned.

df.set_index('Athlete',inplace=True)

In [118]:
df.head()

,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
Athlete,,,,,,,,,
"HAJOS, Alfred",Athens,1896,Aquatics,Swimming,HUN,Men,100m freestyle,M,Gold
"HERSCHMANN, Otto",Athens,1896,Aquatics,Swimming,AUT,Men,100m freestyle,M,Silver
"DRIVAS, Dimitrios",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Bronze
"MALOKINIS, Ioannis",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Gold
"CHASAPIS, Spiridon",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Silver

#### *reset_index()*

In [119]:
df.reset_index(inplace=True)

In [120]:
df.head()

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
0,"HAJOS, Alfred",Athens,1896,Aquatics,Swimming,HUN,Men,100m freestyle,M,Gold
1,"HERSCHMANN, Otto",Athens,1896,Aquatics,Swimming,AUT,Men,100m freestyle,M,Silver
2,"DRIVAS, Dimitrios",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Bronze
3,"MALOKINIS, Ioannis",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Gold
4,"CHASAPIS, Spiridon",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Silver

#### *sort_index()*

In [121]:
# The sort_index() method in pandas is used to sort a DataFrame or a Series by its index. 
# This method returns a new object with the same data but with the index sorted.

In [122]:
# If inplace=False (the default), a new DataFrame with the updated index would be returned, leaving the original DataFrame unchanged.
df.set_index('Athlete',inplace=True)

In [123]:
df.head()

,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
Athlete,,,,,,,,,
"HAJOS, Alfred",Athens,1896,Aquatics,Swimming,HUN,Men,100m freestyle,M,Gold
"HERSCHMANN, Otto",Athens,1896,Aquatics,Swimming,AUT,Men,100m freestyle,M,Silver
"DRIVAS, Dimitrios",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Bronze
"MALOKINIS, Ioannis",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Gold
"CHASAPIS, Spiridon",Athens,1896,Aquatics,Swimming,GRE,Men,100m freestyle for sailors,M,Silver

In [124]:
df.sort_index(inplace=True,ascending=False)

In [125]:
df.head()

,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
Athlete,,,,,,,,,
"ÖSTRAND, Per-Olof",Helsinki,1952,Aquatics,Swimming,SWE,Men,400m freestyle,M,Bronze
"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"free rifle, team",M,Silver
"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, standing",M,Silver
"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, prone",M,Bronze
"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, 3 positions",M,Bronze

In [126]:
df.reset_index(inplace=True)

In [127]:
df.head()

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
0,"ÖSTRAND, Per-Olof",Helsinki,1952,Aquatics,Swimming,SWE,Men,400m freestyle,M,Bronze
1,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"free rifle, team",M,Silver
2,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, standing",M,Silver
3,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, prone",M,Bronze
4,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, 3 positions",M,Bronze

---------------------------------------------

### 14. how to use loc accessor?

#### *.loc[]*

In [128]:
# .loc is used for label-based indexing, allowing you to access a group of rows and # columns by specifying labels or boolean arrays. 
# It is primarily used to select data based on the labels of rows or columns.

In [129]:
# .loc is inclusive on both sides, meaning that the start and stop labels specified are included in the selection.

df.loc[df.Athlete == 'BOLT, Usain']

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
26763,"BOLT, Usain",Beijing,2008,Athletics,Athletics,JAM,Men,4x100m relay,M,Gold
26764,"BOLT, Usain",Beijing,2008,Athletics,Athletics,JAM,Men,200m,M,Gold
26765,"BOLT, Usain",Beijing,2008,Athletics,Athletics,JAM,Men,100m,M,Gold

### 15. how to use iloc accessor?

####  *iloc[]*

In [130]:
# The iloc accessor in pandas is used for integer-location based indexing. 
# It allows you to select data from a DataFrame based on the integer indices of rows and columns.

In [131]:
df.iloc[100]

Athlete         ZORRILLA, Victoriano
City                       Amsterdam
Edition                         1928
Sport                       Aquatics
Discipline                  Swimming
NOC                              ARG
Gender                           Men
Event                 400m freestyle
Event_gender                       M
Medal                           Gold
Name: 100, dtype: object

In [132]:
df.iloc[[1245, 2201, 3430, 12000]]

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
1245,"WIECZOREK-CIEPLY, Teresa Barbara",Tokyo,1964,Athletics,Athletics,POL,Women,80m hurdles,W,Silver
2201,"VEZZALI, Valentina",Beijing,2008,Fencing,Fencing,ITA,Women,foil team,W,Bronze
3430,"TMENOV, Tamerlan",Athens,2004,Judo,Judo,RUS,Men,+ 100kg (heavyweight),M,Silver
12000,"MKRCHYAN, Armen",Atlanta,1996,Wrestling,Wrestling Free.,ARM,Men,- 48kg (light-flyweight),M,Silver

In [133]:
df.iloc[1:7]

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
1,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"free rifle, team",M,Silver
2,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, standing",M,Silver
3,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, prone",M,Bronze
4,"ÖSTMO, Ole",Paris,1900,Shooting,Shooting,NOR,Men,"army rifle, 300m, 3 positions",M,Bronze
5,"ÖSTERVOLD, Ole Olsen",Antwerp,1920,Sailing,Sailing,NOR,Men,12m (rating 1907),X,Gold
6,"ÖSTERVOLD, Kristian Olsen",Antwerp,1920,Sailing,Sailing,NOR,Men,12m (rating 1907),X,Gold

### 16. how to use groupby() function?

####  *groupby()*

In [134]:
# The groupby() function in pandas is used for grouping data based on some criteria, and it is followed 
# by an aggregation or transformation operation. 

# The basic idea is to split the data into groups based on a specified key and then apply a function to 
# each group independently.

In [135]:
list(df.groupby('Edition'))

[(1896,
                          Athlete    City  Edition       Sport    Discipline  \
  48                ZUTTER, Louis  Athens     1896  Gymnastics   Artistic G.
  49                ZUTTER, Louis  Athens     1896  Gymnastics   Artistic G.
  50                ZUTTER, Louis  Athens     1896  Gymnastics   Artistic G.
  756          XENAKIS, Thomasios  Athens     1896  Gymnastics   Artistic G.
  757          XENAKIS, Thomasios  Athens     1896  Gymnastics   Artistic G.
  ...                         ...     ...      ...         ...           ...
  27749            BATTEL, Edward  Athens     1896     Cycling  Cycling Road
  28293    ATHANASOPOULOS, Spyros  Athens     1896  Gymnastics   Artistic G.
  28618  ANDRIAKOPOULOS, Nicolaos  Athens     1896  Gymnastics   Artistic G.
  28619  ANDRIAKOPOULOS, Nicolaos  Athens     1896  Gymnastics   Artistic G.
  28630          ANDREOU, Joannis  Athens     1896    Aquatics      Swimming

         NOC Gender                 Event Event_gender   Medal
  48     SUI    Men                 vault            M  Silver
  49     SUI    Men         parallel bars            M  Silver
  50     SUI    Men          pommel horse            M    Gold
  756    GRE    Men         rope climbing            M  Silver
  757    GRE    Men   team, parallel bars            M  Silver
  ...    ...    ...                   ...          ...     ...
  27749  GBR    Men  individual road race            M  Bronze
  28293  GRE    Men   team, parallel bars            M  Silver
  28618  GRE    Men         rope climbing            M    Gold
  28619  GRE    Men   team, parallel bars            M  Silver
  28630  GRE    Men       1200m freestyle            M  Silver

  [151 rows x 10 columns]),
 (1900,
                       Athlete   City  Edition       Sport  Discipline  NOC  \
  1                 ÖSTMO, Ole  Paris     1900    Shooting    Shooting  NOR
  2                 ÖSTMO, Ole  Paris     1900    Shooting    Shooting  NOR
  3                 ÖSTMO, Ole  Paris     1900    Shooting    Shooting  NOR
  4                 ÖSTMO, Ole  Paris     1900    Shooting    Shooting  NOR
  332    ZEALLEY, James Edward  Paris     1900    Football    Football  GBR
  ...                      ...    ...      ...         ...         ...  ...
  28941             ALBERT, A.  Paris     1900       Rugby       Rugby  FRA
  28990       AITOFF, Vladimir  Paris     1900       Rugby       Rugby  FRA
  29148           ABELL, Louis  Paris     1900      Rowing      Rowing  USA
  29176  ABBOTT, Margaret Ives  Paris     1900        Golf        Golf  USA
  29215           AABYE, Edgar  Paris     1900  Tug of War  Tug of War  ZZX

        Gender                          Event Event_gender   Medal
  1        Men               free rifle, team            M  Silver
  2        Men     army rifle, 300m, standing            M  Silver
  3        Men        army rifle, 300m, prone            M  Bronze
  4        Men  army rifle, 300m, 3 positions            M  Bronze
  332      Men                       football            M    Gold
  ...      ...                            ...          ...     ...
  28941    Men                          rugby            M    Gold
  28990    Men                          rugby            M    Gold
  29148    Men       eight with coxswain (8+)            M    Gold
  29176  Women                     individual            W    Gold
  29215    Men                     tug of war            M    Gold

  [512 rows x 10 columns]),
 (1904,
                    Athlete      City  Edition      Sport       Discipline  NOC  \
  130        ZIRKEL, Albert  St Louis     1904  Wrestling  Wrestling Free.  USA
  454      ZACHARIAS, Georg  St Louis     1904   Aquatics         Swimming  GER
  455      ZACHARIAS, Georg  St Louis     1904   Aquatics         Swimming  GER
  528         YOUNG, Albert  St Louis     1904     Boxing           Boxing  USA
  529                 YOUNG  St Louis     1904   Lacrosse         Lacrosse  USA
  ...                   ...       ...      ...        ...              ...  ...
  28625  ANDREWS, Arthur F.  St Louis     1904    Cycling    Cycling Track  USA
  28626  ANDREWS, Arthur F.  St Louis     1904    Cycling    Cycling Track  USA
  28815       AMAN, Charles  St Louis     1904     Rowing           Rowing  USA
  29096     ADAMS, Edgar H.  St Louis     1904   Aquatics           Diving  USA
  29149        ABELL, Louis  St Louis     1904     Rowing           Rowing  USA

        Gender                           Event Event_gender   Medal
  130      Men   61.23 - 65.77kg (lightweight)            M  Bronze
  454      Men                 100m backstroke            M  Bronze
  455      Men               400m breaststroke            M    Gold
  528      Men  61.24 - 65.77kg (welterweight)            M    Gold
  529      Men                        lacrosse            M  Silver
  ...      ...                             ...          ...     ...
  28625    Men               5 miles (8.046km)            M  Bronze
  28626    Men             25 miles (40.232km)            M  Silver
  28815    Men      four without coxswain (4-)            M  Silver
  29096    Men             plunge for distance            M  Silver
  29149    Men        eight with coxswain (8+)            M    Gold

  [470 rows x 10 columns]),
 (1908,
                            Athlete    City  Edition      Sport Discipline  NOC  \
  19                 ZÜRNER, Albert  London     1908   Aquatics     Diving  GER
  55                 ZULAWSKY, Béla  London     1908    Fencing    Fencing  HUN
  457                  ZACHAR, Imre  London     1908   Aquatics   Swimming  HUN
  830         WRIGHT, Joseph George  London     1908     Rowing     Rowing  CAN
  867         WOODWARD, Vivian John  London     1908   Football   Football  GBR
  ...                           ...     ...      ...        ...        ...  ...
  28898               ALEXANDER, J.  London     1908   Lacrosse   Lacrosse  GBR
  28899  ALEXANDER, Gustav Bernhard  London     1908   Lacrosse   Lacrosse  GBR
  29038          AHEARNE, Timoty J.  London     1908  Athletics  Athletics  GBR
  29073        ADLERSTRAHLE, Märtha  London     1908     Tennis     Tennis  SWE
  29101               ADAM, John M.  London     1908    Sailing    Sailing  GBR

        Gender                     Event Event_gender   Medal
  19       Men            3m springboard            M    Gold
  55       Men          sabre individual            M  Silver
  457      Men    4x200m freestyle relay            M  Silver
  830      Men  eight with coxswain (8+)            M  Bronze
  867      Men                  football            M    Gold
  ...      ...                       ...          ...     ...
  28898    Men                  lacrosse            M  Silver
  28899    Men                  lacrosse            M  Silver
  29038    Men               triple jump            M    Gold
  29073  Women            singles indoor            W  Bronze
  29101    Men                       12m            X  Silver

  [804 rows x 10 columns]),
 (1912,
                      Athlete       City  Edition       Sport   Discipline  NOC  \
  10          ÖSTENSEN, Östen  Stockholm     1912    Shooting     Shooting  NOR
  17          ÖRTEGREN, Ruben  Stockholm     1912    Shooting     Shooting  SWE
  20           ZÜRNER, Albert  Stockholm     1912    Aquatics       Diving  GER
  98            ZORZI, Angelo  Stockholm     1912  Gymnastics  Artistic G.  ITA
  337         ZBORZIL, Arthur  Stockholm     1912      Tennis       Tennis  AUT
  ...                     ...        ...      ...         ...          ...  ...
  29098    ADAMS, Benjamin W.  Stockholm     1912   Athletics    Athletics  USA
  29129      ABRAHAMSEN, Isak  Stockholm     1912  Gymnastics  Artistic G.  NOR
  29145          ABERG, Georg  Stockholm     1912   Athletics    Athletics  SWE
  29146          ABERG, Georg  Stockholm     1912   Athletics    Athletics  SWE
  29201  AAS, Thomas Valentin  Stockholm     1912     Sailing      Sailing  NOR

        Gender                       Event Event_gender   Medal
  10       Men            free rifle, team            M  Silver
  17       Men  50m small bore rifle, team            M  Silver
  20       Men                10m platform            M  Silver
  98       Men            team competition            M    Gold
  337      Men                     doubles            M  Silver
  ...      ...                         ...          ...     ...
  29098    Men         long jump, standing            M  Bronze
  29129    Men           team, free system            M    Gold
  29145    Men                 triple jump            M  Silver
  29146    Men                   long jump            M  Bronze
  29201    Men                          8m            X    Gold

  [885 rows x 10 columns]),
 (1920,
                           Athlete     City  Edition       Sport   Discipline  \
  5           ÖSTERVOLD, Ole Olsen  Antwerp     1920     Sailing      Sailing
  6      ÖSTERVOLD, Kristian Olsen  Antwerp     1920     Sailing      Sailing
  7           ÖSTERVOLD, Jan Olsen  Antwerp     1920     Sailing      Sailing
  8              ÖSTERVOLD, Henrik  Antwerp     1920     Sailing      Sailing
  9                ÖSTENSEN, Östen  Antwerp     1920    Shooting     Shooting
  ...                          ...      ...      ...         ...          ...
  29153                 ABEL, Sten  Antwerp     1920     Sailing      Sailing
  29202              AAS, Karl Jan  Antwerp     1920  Gymnastics  Artistic G.
  29206           AANING, Alf Lied  Antwerp     1920  Gymnastics  Artistic G.
  29213      AALTONEN, Arvo Ossian  Antwerp     1920    Aquatics     Swimming
  29214      AALTONEN, Arvo Ossian  Antwerp     1920    Aquatics     Swimming

         NOC Gender                       Event Event_gender   Medal
  5      NOR    Men           12m (rating 1907)            X    Gold
  6      NOR    Men           12m (rating 1907)            X    Gold
  7      NOR    Men           12m (rating 1907)            X    Gold
  8      NOR    Men           12m (rating 1907)            X    Gold
  9      NOR    Men  50m small bore rifle, team            M  Bronze
  ...    ...    ...                         ...          ...     ...
  29153  NOR    Men                          7m            X  Silver
  29202  NOR    Men           team, free system            M  Silver
  29206  NOR    Men           team, free system            M  Silver
  29213  FIN    Men           200m breaststroke            M  Bronze
  29214  FIN    Men           400m breaststroke            M  Bronze

  [1298 rows x 10 columns]),
 (1924,
                      Athlete   City  Edition          Sport       Discipline  \
  37           ZWERINA, Anton  Paris     1924  Weightlifting    Weightlifting
  71     ZUCCHETTI, Francesco  Paris     1924        Cycling    Cycling Track
  135             ZINGONE, P.  Paris     1924       Football         Football
  169     ZIBECHI, Alfredo J.  Paris     1924       Football         Football
  378          ZANDER, Robert  Paris     1924       Football         Football
  ...                     ...    ...      ...            ...              ...
  29034       AHLFORS, Anselm  Paris     1924      Wrestling  Wrestling Gre-R
  29130      ABRAHAMS, Harold  Paris     1924      Athletics        Athletics
  29131      ABRAHAMS, Harold  Paris     1924      Athletics        Athletics
  29134           ABRAHAM, F.  Paris     1924          Rugby            Rugby
  29155         ABEGGLEN, Max  Paris     1924       Football         Football

         NOC Gender                                             Event  \
  37     AUT    Men  60 - 67.5kg, one-two hand 5 events (lightweight)
  71     ITA    Men                              Team Pursuit (4000m)
  135    URU    Men                                          football
  169    URU    Men                                          football
  378    SWE    Men                                          football
  ...    ...    ...                                               ...
  29034  FIN    Men                             - 58kg (bantamweight)
  29130  GBR    Men                                              100m
  29131  GBR    Men                                      4x100m relay
  29134  FRA    Men                                             rugby
  29155  SUI    Men                                          football

        Event_gender   Medal
  37               M  Silver
  71               M    Gold
  135              M    Gold
  169              M    Gold
  378              M  Bronze
  ...            ...     ...
  29034            M  Silver
  29130            M    Gold
  29131            M  Silver
  29134            M  Silver
  29155            M  Silver

  [884 rows x 10 columns]),
 (1928,
                          Athlete       City  Edition       Sport   Discipline  \
  51               ZUMELZU, A. B.  Amsterdam     1928    Football     Football
  100        ZORRILLA, Victoriano  Amsterdam     1928    Aquatics     Swimming
  383               ZANDER, Erich  Amsterdam     1928      Hockey       Hockey
  464            ZABIELSKI, Jerzy  Amsterdam     1928     Fencing      Fencing
  477        YUSUF, Sayed Mohamed  Amsterdam     1928      Hockey       Hockey
  ...                         ...        ...      ...         ...          ...
  28785        AMBROSETTI, Bianca  Amsterdam     1928  Gymnastics  Artistic G.
  28806                AMANN, Max  Amsterdam     1928    Aquatics   Water polo
  28857      ALLEN, Richard James  Amsterdam     1928      Hockey       Hockey
  28922  ALDERMAN, Frederick Pitt  Amsterdam     1928   Athletics    Athletics
  29045       AGSTERIBBE, Estella  Amsterdam     1928  Gymnastics  Artistic G.

         NOC Gender             Event Event_gender   Medal
  51     ARG    Men          football            M  Silver
  100    ARG    Men    400m freestyle            M    Gold
  383    GER    Men            hockey            M  Bronze
  464    POL    Men        sabre team            M  Bronze
  477    IND    Men            hockey            M    Gold
  ...    ...    ...               ...          ...     ...
  28785  ITA  Women  team competition            W  Silver
  28806  GER    Men        water polo            M    Gold
  28857  IND    Men            hockey            M    Gold
  28922  USA    Men      4x400m relay            M    Gold
  29045  NED  Women  team competition            W    Gold

  [710 rows x 10 columns]),
 (1932,
                        Athlete         City  Edition      Sport  \
  106             ZOMBORI, Ödön  Los Angeles     1932  Wrestling
  158           ZIGLARSKI, Hans  Los Angeles     1932     Boxing
  357    ZAREMBA, Peter Timothy  Los Angeles     1932  Athletics
  475       ZABALA, Juan Carlos  Los Angeles     1932  Athletics
  481            YUSA, Masanori  Los Angeles     1932   Aquatics
  ...                       ...          ...      ...        ...
  29030         AHLQVIST, Thure  Los Angeles     1932     Boxing
  29035  AHLBERG, Bruno Valfrid  Los Angeles     1932     Boxing
  29048         AGOSTONI, Carlo  Los Angeles     1932    Fencing
  29049         AGOSTONI, Carlo  Los Angeles     1932    Fencing
  29139   ABLOWICH, Edgar Allen  Los Angeles     1932  Athletics

              Discipline  NOC Gender                           Event  \
  106    Wrestling Free.  HUN    Men           - 56kg (bantamweight)
  158             Boxing  GER    Men      50.8 - 54kg (bantamweight)
  357          Athletics  USA    Men                    hammer throw
  475          Athletics  ARG    Men                        marathon
  481           Swimming  JPN    Men          4x200m freestyle relay
  ...                ...  ...    ...                             ...
  29030           Boxing  SWE    Men   57.15 - 61.24kg (lightweight)
  29035           Boxing  FIN    Men  61.24 - 66.68kg (welterweight)
  29048          Fencing  ITA    Men                       épée team
  29049          Fencing  ITA    Men                 épée individual
  29139        Athletics  USA    Men                    4x400m relay

        Event_gender   Medal
  106              M  Silver
  158              M  Silver
  357              M  Bronze
  475              M    Gold
  481              M    Gold
  ...            ...     ...
  29030            M  Silver
  29035            M  Bronze
  29048            M  Silver
  29049            M  Bronze
  29139            M    Gold

  [615 rows x 10 columns]),
 (1936,
                     Athlete    City  Edition              Sport  \
  107          ZOMBORI, Ödön  Berlin     1936          Wrestling
  328       ZEHETNER, Johann  Berlin     1936           Handball
  382          ZANDER, Erich  Berlin     1936             Hockey
  480         YUSA, Masanori  Berlin     1936           Aquatics
  482         YUSA, Masanori  Berlin     1936           Aquatics
  ...                    ...     ...      ...                ...
  29090     ADAMSKI, Herbert  Berlin     1936             Rowing
  29100           ADAM, Otto  Berlin     1936            Fencing
  29103  ADAM, Gordon Belgum  Berlin     1936             Rowing
  29187        ABBA, Silvano  Berlin     1936  Modern Pentathlon
  29188   ABAY-NEMES, Oszkar  Berlin     1936           Aquatics

              Discipline  NOC Gender                                Event  \
  107    Wrestling Free.  HUN    Men                - 56kg (bantamweight)
  328           Handball  AUT    Men                             handball
  382             Hockey  GER    Men                               hockey
  480           Swimming  JPN    Men               4x200m freestyle relay
  482           Swimming  JPN    Men                       100m freestyle
  ...                ...  ...    ...                                  ...
  29090           Rowing  GER    Men  pair-oared shell with coxswain (2+)
  29100          Fencing  GER    Men                            foil team
  29103           Rowing  USA    Men             eight with coxswain (8+)
  29187  Modern Pentath.  ITA    Men               Individual competition
  29188         Swimming  HUN    Men               4x200m freestyle relay

        Event_gender   Medal
  107              M    Gold
  328              M  Silver
  382              M  Silver
  480              M    Gold
  482              M  Silver
  ...            ...     ...
  29090            M    Gold
  29100            M  Bronze
  29103            M    Gold
  29187            M  Bronze
  29188            M  Bronze

  [875 rows x 10 columns]),
 (1948,
                           Athlete    City  Edition       Sport     Discipline  \
  63          ZUDDAS, Gianbattista  London     1948      Boxing         Boxing
  85             ZSITNIK SR., Bela  London     1948      Rowing         Rowing
  138              ZIMONYI, Robert  London     1948      Rowing         Rowing
  144    ZIMMERMAN, Suzanne Winona  London     1948    Aquatics       Swimming
  348                ZATOPEK, Emil  London     1948   Athletics      Athletics
  ...                          ...     ...      ...         ...            ...
  29099               ADAM, Pierre  London     1948     Cycling  Cycling Track
  29208   AALTONEN, Paavo Johannes  London     1948  Gymnastics    Artistic G.
  29210   AALTONEN, Paavo Johannes  London     1948  Gymnastics    Artistic G.
  29211   AALTONEN, Paavo Johannes  London     1948  Gymnastics    Artistic G.
  29212   AALTONEN, Paavo Johannes  London     1948  Gymnastics    Artistic G.

         NOC Gender                                Event Event_gender   Medal
  63     ITA    Men             51 - 54kg (bantamweight)            M  Silver
  85     HUN    Men  pair-oared shell with coxswain (2+)            M  Bronze
  138    HUN    Men  pair-oared shell with coxswain (2+)            M  Bronze
  144    USA  Women                      100m backstroke            W  Silver
  348    TCH    Men                               10000m            M    Gold

In [136]:
# Aggregation with groupby()

In [137]:
df.groupby('Edition').size()

Edition
1896     151
1900     512
1904     470
1908     804
1912     885
1920    1298
1924     884
1928     710
1932     615
1936     875
1948     814
1952     889
1956     885
1960     882
1964    1010
1968    1031
1972    1185
1976    1305
1980    1387
1984    1459
1988    1546
1992    1705
1996    1859
2000    2015
2004    1998
2008    2042
dtype: int64

In [138]:
# min, max, and count

In [139]:
df.groupby(['Edition','NOC','Medal']).agg(['min','max','count'])

                                    Athlete                                 \
                                        min                      max count
Edition NOC Medal
1896    AUS Gold               FLACK, Edwin             FLACK, Edwin     2
        AUT Bronze            SCHMAL, Adolf            SCHMAL, Adolf     2
            Gold              NEUMANN, Paul            SCHMAL, Adolf     2
            Silver         HERSCHMANN, Otto         HERSCHMANN, Otto     1
        DEN Bronze            JENSEN, Viggo          NIELSEN, Holger     3
...                                     ...                      ...   ...
2008    UZB Silver        TANGRIEV, Abdullo           TIGIEV, Soslan     2
        VEN Bronze  CONTRERAS RIVERO, Dalia  CONTRERAS RIVERO, Dalia     1
        VIE Silver          HOANG, Anh Tuan          HOANG, Anh Tuan     1
        ZIM Gold           COVENTRY, Kirsty         COVENTRY, Kirsty     1
            Silver         COVENTRY, Kirsty         COVENTRY, Kirsty     3

                       City                         Sport                 \
                        min      max count            min            max
Edition NOC Medal
1896    AUS Gold     Athens   Athens     2      Athletics      Athletics
        AUT Bronze   Athens   Athens     2        Cycling        Cycling
            Gold     Athens   Athens     2       Aquatics        Cycling
            Silver   Athens   Athens     1       Aquatics       Aquatics
        DEN Bronze   Athens   Athens     3        Fencing       Shooting
...                     ...      ...   ...            ...            ...
2008    UZB Silver  Beijing  Beijing     2           Judo      Wrestling
        VEN Bronze  Beijing  Beijing     1      Taekwondo      Taekwondo
        VIE Silver  Beijing  Beijing     1  Weightlifting  Weightlifting
        ZIM Gold    Beijing  Beijing     1       Aquatics       Aquatics
            Silver  Beijing  Beijing     3       Aquatics       Aquatics

                             Discipline  ...       Gender               \
                   count            min  ... count    min    max count
Edition NOC Medal                        ...
1896    AUS Gold       2      Athletics  ...     2    Men    Men     2
        AUT Bronze     2  Cycling Track  ...     2    Men    Men     2
            Gold       2  Cycling Track  ...     2    Men    Men     2
            Silver     1       Swimming  ...     1    Men    Men     1
        DEN Bronze     3        Fencing  ...     3    Men    Men     3
...                  ...            ...  ...   ...    ...    ...   ...
2008    UZB Silver     2           Judo  ...     2    Men    Men     2
        VEN Bronze     1      Taekwondo  ...     1  Women  Women     1
        VIE Silver     1  Weightlifting  ...     1    Men    Men     1
        ZIM Gold       1       Swimming  ...     1  Women  Women     1
            Silver     3       Swimming  ...     3  Women  Women     3

                                               Event  \
                                                 min
Edition NOC Medal
1896    AUS Gold                               1500m
        AUT Bronze                              10km
            Gold                        12-hour race
            Silver                    100m freestyle
        DEN Bronze  25m rapid fire pistol (60 shots)
...                                              ...
2008    UZB Silver             + 100kg (heavyweight)
        VEN Bronze                           - 49 kg
        VIE Silver      - 56kg, total (bantamweight)
        ZIM Gold                     200m backstroke
            Silver                   100m backstroke

                                                       Event_gender
                                             max count          min max count
Edition NOC Medal
1896    AUS Gold                            800m     2            M   M     2
        AUT Bronze                1km time trial     2            M   M     2
            Gold                  400m freestyle     2            M   M     2
            Silver                100m freestyle     1            M   M     1
        DEN Bronze              sabre individual     3            M   M     3
...                                          ...   ...          ...  ..   ...
2008    UZB Silver                     66 - 74kg     2            M   M     2
        VEN Bronze                       - 49 kg     1            W   W     1
        VIE Silver  - 56kg, total (bantamweight)     1            M   M     1
        ZIM Gold                 200m backstroke     1            W   W     1
            Silver        400m individual medley     3            W   W     3

[2356 rows x 21 columns]

In [140]:
df.groupby(['Edition','NOC','Medal']).size()

Edition  NOC  Medal
1896     AUS  Gold      2
         AUT  Bronze    2
              Gold      2
              Silver    1
         DEN  Bronze    3
                       ..
2008     UZB  Silver    2
         VEN  Bronze    1
         VIE  Silver    1
         ZIM  Gold      1
              Silver    3
Length: 2356, dtype: int64

In [141]:
df.groupby(['Edition','NOC','Medal']).agg({'Edition' :['min','max','count']})

                   Edition
                       min   max count
Edition NOC Medal
1896    AUS Gold      1896  1896     2
        AUT Bronze    1896  1896     2
            Gold      1896  1896     2
            Silver    1896  1896     1
        DEN Bronze    1896  1896     3
...                    ...   ...   ...
2008    UZB Silver    2008  2008     2
        VEN Bronze    2008  2008     1
        VIE Silver    2008  2008     1
        ZIM Gold      2008  2008     1
            Silver    2008  2008     3

[2356 rows x 3 columns]

In [142]:
df.loc[df.Athlete == 'LEWIS, Carl'].groupby('Athlete').agg({'Edition' : ['min','max','count']})

            Edition
                min   max count
Athlete
LEWIS, Carl    1984  1996    10

### 17. how to use stack() function?

####  *stack()*

In [143]:
# The stack() function is used to pivot the DataFrame, moving the innermost column index to become the innermost row index. 
# This operation is often called "stacking" because it stacks the specified level(s) from columns to index.

In [144]:
# Athletes winning medals in Beijing Olympics 100m or 200m track event
mw = df[(df.Edition == 2008) & ( (df.Event == '100m') | (df.Event == '200m'))]
mw

,Athlete,City,Edition,Sport,Discipline,NOC,Gender,Event,Event_gender,Medal
3635,"THOMPSON, Richard",Beijing,2008,Athletics,Athletics,TRI,Men,100m,M,Silver
4782,"STEWART, Kerron",Beijing,2008,Athletics,Athletics,JAM,Women,200m,W,Bronze
4783,"STEWART, Kerron",Beijing,2008,Athletics,Athletics,JAM,Women,100m,W,Silver
5678,"SIMPSON, Sherone",Beijing,2008,Athletics,Athletics,JAM,Women,100m,W,Silver
21686,"FRASER, Shelly-ann",Beijing,2008,Athletics,Athletics,JAM,Women,100m,W,Gold
22197,"FELIX, Allyson",Beijing,2008,Athletics,Athletics,USA,Women,200m,W,Silver
23384,"DIX, Walter",Beijing,2008,Athletics,Athletics,USA,Men,100m,M,Bronze
23385,"DIX, Walter",Beijing,2008,Athletics,Athletics,USA,Men,200m,M,Bronze
24485,"CRAWFORD, Shawn",Beijing,2008,Athletics,Athletics,USA,Men,200m,M,Silver
25690,"CAMPBELL-BROWN, Veronica",Beijing,2008,Athletics,Athletics,JAM,Women,200m,W,Gold
26764,"BOLT, Usain",Beijing,2008,Athletics,Athletics,JAM,Men,200m,M,Gold
26765,"BOLT, Usain",Beijing,2008,Athletics,Athletics,JAM,Men,100m,M,Gold

In [145]:
g = mw.groupby(['NOC','Gender','Discipline','Event']).size()
g

NOC  Gender  Discipline  Event
JAM  Men     Athletics   100m     1
                         200m     1
     Women   Athletics   100m     3
                         200m     2
TRI  Men     Athletics   100m     1
USA  Men     Athletics   100m     1
                         200m     2
     Women   Athletics   200m     1
dtype: int64

In [146]:
dfs = g.unstack(['Discipline','Event'])
dfs

Discipline Athletics
Event           100m 200m
NOC Gender
JAM Men          1.0  1.0
    Women        3.0  2.0
TRI Men          1.0  NaN
USA Men          1.0  2.0
    Women        NaN  1.0

In [147]:
dfs

Discipline Athletics
Event           100m 200m
NOC Gender
JAM Men          1.0  1.0
    Women        3.0  2.0
TRI Men          1.0  NaN
USA Men          1.0  2.0
    Women        NaN  1.0

In [148]:
dfs.stack()

C:\Users\Raza\AppData\Local\Temp\ipykernel_4192\451286860.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  dfs.stack()

Discipline        Athletics
NOC Gender Event
JAM Men    100m         1.0
           200m         1.0
    Women  100m         3.0
           200m         2.0
TRI Men    100m         1.0
USA Men    100m         1.0
           200m         2.0
    Women  200m         1.0

In [149]:
dfs.stack('Event')

C:\Users\Raza\AppData\Local\Temp\ipykernel_4192\712368339.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  dfs.stack('Event')

Discipline        Athletics
NOC Gender Event
JAM Men    100m         1.0
           200m         1.0
    Women  100m         3.0
           200m         2.0
TRI Men    100m         1.0
USA Men    100m         1.0
           200m         2.0
    Women  200m         1.0

### 18. how to use unstack() function?

###  *unstack()*

In [150]:
dfs

Discipline Athletics
Event           100m 200m
NOC Gender
JAM Men          1.0  1.0
    Women        3.0  2.0
TRI Men          1.0  NaN
USA Men          1.0  2.0
    Women        NaN  1.0

In [151]:
dfs.unstack()

Discipline Athletics
Event           100m       200m
Gender           Men Women  Men Women
NOC
JAM              1.0   3.0  1.0   2.0
TRI              1.0   NaN  NaN   NaN
USA              1.0   NaN  2.0   1.0

#### Practice Questions

##### Q1. List our Olympics DataFrame

In [167]:
df = pd.read_csv('../data/olympics.csv',skiprows=4)

In [168]:
df

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver
...,...,...,...,...,...,...,...,...,...,...
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

##### Q2. List only the NOC column using both [`..`] and dot notation. What type is this object?

In [157]:
df['NOC']

0        HUN
1        AUT
2        GRE
3        GRE
4        GRE
        ...
29211    GER
29212    LTU
29213    ARM
29214    CUB
29215    RUS
Name: NOC, Length: 29216, dtype: object

In [158]:
df.NOC

0        HUN
1        AUT
2        GRE
3        GRE
4        GRE
        ...
29211    GER
29212    LTU
29213    ARM
29214    CUB
29215    RUS
Name: NOC, Length: 29216, dtype: object

In [159]:
type(df.NOC)

pandas.core.series.Series

##### Q3. List the Edition, City, Athlete Name, and Medal columns. What type is this object?

In [161]:
type(df[['Edition', 'City', 'Athlete', 'Medal']])

pandas.core.frame.DataFrame

##### Q4. In which events did Jesse Owens win a medal?

In [169]:
jo = df[df.Athlete == 'OWENS, Jesse']
jo

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
6427,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,100m,M,Gold
6439,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,200m,M,Gold
6456,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,4x100m relay,M,Gold
6523,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,long jump,M,Gold

In [171]:
jo.Event.value_counts()

Event
100m            1
200m            1
4x100m relay    1
long jump       1
Name: count, dtype: int64

##### Q5. Which country has won the most men's gold medals in singles badminton over the years? Sort the results alphabetically by the player's names.

In [173]:
gold_bm_men = df[(df.Medal == 'Gold') & (df.Gender == 'Men') & (df.Sport == 'Badminton')]
gold_bm_men.sort_values(by='Athlete')

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
20045,Barcelona,1992,Badminton,Badminton,"BUDI KUSUMA, Alan",INA,Men,singles,M,Gold
23701,Sydney,2000,Badminton,Badminton,"GUNAWAN, Tony",INA,Men,doubles,M,Gold
25718,Athens,2004,Badminton,Badminton,"HA, Tae-Kwon",KOR,Men,doubles,M,Gold
25734,Athens,2004,Badminton,Badminton,"HIDAYAT, Taufik",INA,Men,singles,M,Gold
21787,Atlanta,1996,Badminton,Badminton,"HOYER-LARSEN, Poul Erik",DEN,Men,singles,M,Gold
23717,Sydney,2000,Badminton,Badminton,"JI, Xinpeng",CHN,Men,singles,M,Gold
27725,Beijing,2008,Badminton,Badminton,"KIDO, Markis",INA,Men,doubles,M,Gold
25719,Athens,2004,Badminton,Badminton,"KIM, Dong Moon",KOR,Men,doubles,M,Gold
21773,Atlanta,1996,Badminton,Badminton,"KIM, Dong Moon",KOR,Men,doubles,X,Gold
20031,Barcelona,1992,Badminton,Badminton,"KIM, Moon-Soo",KOR,Men,doubles,M,Gold
27727,Beijing,2008,Badminton,Badminton,"LEE, Yongdae",KOR,Men,doubles,X,Gold
27741,Beijing,2008,Badminton,Badminton,"LIN, Dan",CHN,Men,singles,M,Gold
21771,Atlanta,1996,Badminton,Badminton,"MAINAKY, Rexy Ronald",INA,Men,doubles,M,Gold
20032,Barcelona,1992,Badminton,Badminton,"PARK, Joo-Bong",KOR,Men,doubles,M,Gold
27726,Beijing,2008,Badminton,Badminton,"SETIAWAN, Hendra",INA,Men,doubles,M,Gold
21772,Atlanta,1996,Badminton,Badminton,"SUBAGJA, Ricky Achmad",INA,Men,doubles,M,Gold
23702,Sydney,2000,Badminton,Badminton,"WIJAYA, Candra",INA,Men,doubles,M,Gold
25720,Athens,2004,Badminton,Badminton,"ZHANG, Jun",CHN,Men,doubles,X,Gold
23703,Sydney,2000,Badminton,Badminton,"ZHANG, Jun",CHN,Men,doubles,X,Gold

##### Q6. Which three countries have won the most medals in recent years (from 1984 to 2008)?

In [174]:
rec = df[df.Edition >= 1984]
rec.NOC.value_counts().head(3)

NOC
USA    1837
AUS     762
GER     691
Name: count, dtype: int64

##### Q7. Display the male gold medal winners for the 100m Track & Field sprint event over the years.

In [176]:
gold_male_hm = df[(df.Gender == 'Men') & (df.Medal == 'Gold') & (df.Event == '100m')]

                        City  Edition                Athlete  NOC
27552                Beijing     2008            BOLT, Usain  JAM
25539                 Athens     2004         GATLIN, Justin  USA
23521                 Sydney     2000        GREENE, Maurice  USA
21598                Atlanta     1996        BAILEY, Donovan  CAN
19859              Barcelona     1992      CHRISTIE, Linford  GBR
18284                  Seoul     1988            LEWIS, Carl  USA
16794            Los Angeles     1984            LEWIS, Carl  USA
15374                 Moscow     1980           WELLS, Allan  GBR
14069               Montreal     1976       CRAWFORD, Hasely  TRI
12902                 Munich     1972         BORZOV, Valery  URS
11865                 Mexico     1968       HINES, James Ray  USA
10823                  Tokyo     1964          HAYES, Robert  USA
9924                    Rome     1960            HARY, Armin  EUA
9009   Melbourne / Stockholm     1956  MORROW, Robert Joseph  USA
8121                Helsinki     1952        REMIGINO, Lindy  USA
7302                  London     1948      DILLARD, Harrison  USA
6427                  Berlin     1936           OWENS, Jesse  USA
5806             Los Angeles     1932           TOLAN, Eddie  USA
5095               Amsterdam     1928        WILLIAMS, Percy  CAN
4236                   Paris     1924       ABRAHAMS, Harold  GBR
2996                 Antwerp     1920       PADDOCK, Charles  USA
2022               Stockholm     1912           CRAIG, Ralph  USA
1191                  London     1908       WALKER, Reginald  RSA
737                 St Louis     1904           HAHN, Archie  USA
231                    Paris     1900        JARVIS, Francis  USA
13                    Athens     1896          BURKE, Thomas  USA

##### Q8. Cont'd...List the results starting with the most recent. Show the Olympic City, Edition, Athlete and the country they represent.

In [180]:
gold_male_hm.sort_values('Edition',ascending=False)[['City','Edition','Athlete','NOC']]

                        City  Edition                Athlete  NOC
27552                Beijing     2008            BOLT, Usain  JAM
25539                 Athens     2004         GATLIN, Justin  USA
23521                 Sydney     2000        GREENE, Maurice  USA
21598                Atlanta     1996        BAILEY, Donovan  CAN
19859              Barcelona     1992      CHRISTIE, Linford  GBR
18284                  Seoul     1988            LEWIS, Carl  USA
16794            Los Angeles     1984            LEWIS, Carl  USA
15374                 Moscow     1980           WELLS, Allan  GBR
14069               Montreal     1976       CRAWFORD, Hasely  TRI
12902                 Munich     1972         BORZOV, Valery  URS
11865                 Mexico     1968       HINES, James Ray  USA
10823                  Tokyo     1964          HAYES, Robert  USA
9924                    Rome     1960            HARY, Armin  EUA
9009   Melbourne / Stockholm     1956  MORROW, Robert Joseph  USA
8121                Helsinki     1952        REMIGINO, Lindy  USA
7302                  London     1948      DILLARD, Harrison  USA
6427                  Berlin     1936           OWENS, Jesse  USA
5806             Los Angeles     1932           TOLAN, Eddie  USA
5095               Amsterdam     1928        WILLIAMS, Percy  CAN
4236                   Paris     1924       ABRAHAMS, Harold  GBR
2996                 Antwerp     1920       PADDOCK, Charles  USA
2022               Stockholm     1912           CRAIG, Ralph  USA
1191                  London     1908       WALKER, Reginald  RSA
737                 St Louis     1904           HAHN, Archie  USA
231                    Paris     1900        JARVIS, Francis  USA
13                    Athens     1896          BURKE, Thomas  USA

##### Q9. Create a list showing the total number of medals won for each country over the history of the Olympics. For each country, include the year of the first and most recent Olympic medal wins.

In [182]:
df.groupby('NOC').agg({'Edition' : ['count','min','max']})

    Edition
      count   min   max
NOC
AFG       1  2008  2008
AHO       1  1988  1988
ALG      14  1984  2008
ANZ      29  1908  1912
ARG     239  1924  2008
..      ...   ...   ...
VIE       2  2000  2008
YUG     435  1924  2000
ZAM       2  1984  1996
ZIM      23  1980  2008
ZZX      48  1896  1904

[138 rows x 3 columns]

##### Q10. Athletes winning medals in Beijing Olympics 100m or 200m track event

In [184]:
bj_track_medals = df[(df.Edition == 2008) & ( (df.Event == '100m') | (df.Event == '200m'))]
bj_track_medals

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
27551,Beijing,2008,Athletics,Athletics,"DIX, Walter",USA,Men,100m,M,Bronze
27552,Beijing,2008,Athletics,Athletics,"BOLT, Usain",JAM,Men,100m,M,Gold
27553,Beijing,2008,Athletics,Athletics,"THOMPSON, Richard",TRI,Men,100m,M,Silver
27554,Beijing,2008,Athletics,Athletics,"FRASER, Shelly-ann",JAM,Women,100m,W,Gold
27555,Beijing,2008,Athletics,Athletics,"SIMPSON, Sherone",JAM,Women,100m,W,Silver
27556,Beijing,2008,Athletics,Athletics,"STEWART, Kerron",JAM,Women,100m,W,Silver
27569,Beijing,2008,Athletics,Athletics,"DIX, Walter",USA,Men,200m,M,Bronze
27570,Beijing,2008,Athletics,Athletics,"BOLT, Usain",JAM,Men,200m,M,Gold
27571,Beijing,2008,Athletics,Athletics,"CRAWFORD, Shawn",USA,Men,200m,M,Silver
27572,Beijing,2008,Athletics,Athletics,"STEWART, Kerron",JAM,Women,200m,W,Bronze
27573,Beijing,2008,Athletics,Athletics,"CAMPBELL-BROWN, Veronica",JAM,Women,200m,W,Gold
27574,Beijing,2008,Athletics,Athletics,"FELIX, Allyson",USA,Women,200m,W,Silver

### The End

----------------------------------------------------